[
  {
    "title":"Kohli closes in on Rohit at the top of ODI batting rankings",
    "description":"Virat Kohli's Player-of-the-Series performance against South Africa has pushed him up to No. 2 among ODI batters in the latest update in the ICC rankings. Kohli is only behind Rohit Sharma on the table.<br><br>Kohli climbed two places following the series to displace Daryl Mitchell from the second spot after tallying 302 runs at an average of 151 in the three matches against South Africa. That included back-to-back hundreds in the first two matches before an unbeaten 65 in the third game as India won the series 2-1.<br><br>Rohit, meanwhile, held on to the top spot after a good time of it himself. He struck two half-centuries on his way to 146 runs in the series at an average of 48.67, and has 781 rating points compared to Kohli's 773.",
    "banner":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_wide_w_1280,q_70/lsci/db/PICTURES/CMS/410200/410232.6.jpg",
    "author":"ESPNcricinfo staff",
    "authorLink":"https://www.espncricinfo.com/story/icc-rankings-virat-kohli-closes-in-on-rohit-sharma-at-the-top-of-odi-batting-table-1515174",
    "time":"10-Dec-2025",
  },
  {
    "title":"Dinesh Karthik appointed London Spirit mentor and batting coach",
    "description":"Dinesh Karthik has been appointed mentor and batting coach for men's Hundred team London Spirit in what is his first support-staff role with a franchise outside the IPL.<br><br>It is a pleasure to welcome DK to London Spirit, Spirit director of cricket Mo Bobat said in a statement. He is a truly original thinker in our game and his vast experience in short-format and franchise cricket will be invaluable to us. He is also great fun to work with and brings an infectious energy and enthusiasm to everything he does.<br><br>The signing of another elite individual with significant stature in the game demonstrates our ambition, and the importance we place on ensuring that our players receive the best possible support.<br><br>Karthik, who is a prominent broadcast commentator, has played a similar role with Royal Challengers Bengaluru (RCB) in IPL 2025 after finishing his IPL career in 2024. He is also an active cricketer and is currently representing Sharjah Warriorz in the UAEs ILT20. Bobat is also the team director at RCB, the reigning IPL champions.",
    "banner":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_wide_w_1280,q_70/lsci/db/PICTURES/CMS/381300/381318.6.jpg",
    "author":"ESPNcricinfo staff",
    "authorLink":"https://www.espncricinfo.com/story/the-hundred-former-india-cricketer-dinesh-karthik-appointed-london-spirit-mentor-and-batting-coach-1515169",
    "time":"10-Dec-2025",
  },
  {
    "title":"2026 T20 World Cup: Packed run-in for India, no games for Australia and Bangladesh",
    "description":"With the T20 World Cup fast approaching, the teams have mapped out their final blocks of preparation. India, the defending champions, have the heaviest workload of all the Full Member teams ahead of the 2026 edition, lining up ten home T20Is in December and January. Some other teams, however, play far fewer games in the lead-up. Here's how each team is preparing for the tournament.<br><br><strong>Afghanistan</strong><br>No T20Is before the World Cup<br><br><strong>Australia</strong><br>No T20Is before the World Cup<br><br><strong>Bangladesh</strong><br>No T20Is before the World Cup<br><br><strong>England</strong><br>Three T20Is vs Sri Lanka, away, January-February 2026<br><br><strong>India</strong><br>Five T20Is vs South Africa, home, December 2025<br>Five T20Is vs New Zealand, home, January 2026<br><br><strong>Ireland</strong><br>No T20Is before the World Cup<br><br><strong>New Zealand</strong><br>Five T20Is vs India, away, January 2026<br><br><strong>Pakistan</strong><br>Three T20Is vs Sri Lanka, away, January 2026<br><br><strong>South Africa</strong><br>Five T20Is vs India, away, December 2025<br>Three T20Is vs West Indies, home, January-February 2026<br><br><strong>Sri Lanka</strong><br>Three T20Is vs Pakistan, home, January 2026<br>Three T20Is vs England, home, January-February 2026<br><br><strong>West Indies</strong><br>Three T20Is vs South Africa, home, January-February 2026<br><br><strong>Zimbabwe<strong><br>No T20Is before the World Cup<br><br>",
    "banner":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_wide_w_1280,q_70/lsci/db/PICTURES/CMS/384000/384080.6.jpg",
    "author":"ESPNcricinfo staff",
    "authorLink":"https://www.espncricinfo.com/story/2026-t20-world-cup-packed-run-in-for-india-no-games-for-australia-and-bangladesh-1515190",
    "time":"10-Dec-2025",
  }
]